Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваВКредитныхИнструментах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКредитногоИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКредитныхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ДенежныеСредстваВКредитныхИнструментах/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	КонтрольВидаБанковскихСчетов(Отказ);
	
КонецПроцедуры

Процедура КонтрольВидаБанковскихСчетов(Отказ)
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		Если ЭтотОбъект[0].Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК") Тогда
			//Проверка только для управляющих компаний
			//ДК ошибочно попадает в проверку. #ТехническийДолг #Архитектор #Аналитик
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.Период КАК ДАТА) КАК Период,
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.Организация КАК Справочник.Организации) КАК Организация,
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.КредитныйИнструмент КАК Справочник.ДепозитныеВклады) КАК ДепозитныйВклад,
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.ТипКредитногоИнструмента КАК Перечисление.ТипыКредитныхИнструментов) КАК ТипКредитногоИнструмента,
			|	ВЫРАЗИТЬ(ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления КАК Справочник.СчетаДоверительногоУправления) КАК СчетДоверительногоУправления
			|ПОМЕСТИТЬ _ДенежныеСредстваВКредитныхИнструментах
			|ИЗ
			|	&ДенежныеСредстваВКредитныхИнструментах КАК ДенежныеСредстваВКредитныхИнструментах
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДенежныеСредстваВКредитныхИнструментах.Период КАК Период,
			|	_ДенежныеСредстваВКредитныхИнструментах.Организация КАК Организация,
			|	_ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДенежныеСредстваВКредитныхИнструментах.ДепозитныйВклад КАК ДепозитныйВклад,
			|	_ДенежныеСредстваВКредитныхИнструментах.ДепозитныйВклад.БанковскийСчет КАК БанковскийСчет,
			|	ЛицензииДоговоровДоверительногоУправления.Лицензия КАК Лицензия,
			|	МАКСИМУМ(ЛицензииДоговоровДоверительногоУправления.Период) КАК ПериодЛицензииДоговоровДоверительногоУправления
			|ПОМЕСТИТЬ _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий
			|ИЗ
			|	_ДенежныеСредстваВКредитныхИнструментах КАК _ДенежныеСредстваВКредитныхИнструментах
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УправляющиеКомпании КАК УправляющиеКомпании
			|		ПО _ДенежныеСредстваВКредитныхИнструментах.Организация.ЮрФизЛицо = УправляющиеКомпании.ЮрФизЛицо
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
			|		ПО _ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
			|			И _ДенежныеСредстваВКредитныхИнструментах.Период >= ЛицензииДоговоровДоверительногоУправления.Период
			|ГДЕ
			|	_ДенежныеСредстваВКредитныхИнструментах.ТипКредитногоИнструмента = ЗНАЧЕНИЕ(Перечисление.ТипыКредитныхИнструментов.ДепозитныйВклад)
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДенежныеСредстваВКредитныхИнструментах.Период,
			|	_ДенежныеСредстваВКредитныхИнструментах.Организация,
			|	_ДенежныеСредстваВКредитныхИнструментах.ДепозитныйВклад,
			|	_ДенежныеСредстваВКредитныхИнструментах.СчетДоверительногоУправления,
			|	_ДенежныеСредстваВКредитныхИнструментах.ДепозитныйВклад.БанковскийСчет,
			|	ЛицензииДоговоровДоверительногоУправления.Лицензия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Период КАК Период,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Организация КАК Организация,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.ДепозитныйВклад КАК ДепозитныйВклад,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.БанковскийСчет КАК БанковскийСчет,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеЛицензииДоговоровДоверительногоУправления.Действует) = 0 КАК НеЗаданыУсловияДоговоровДоверительногоУправления,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.БанковскийСчет.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.ДепозитныйСчет) КАК ВидБанковскогоСчетаНеДепозитныйВклад,
			|	НЕ ЕСТЬNULL(МАКСИМУМ(ЛицензииДоговоровДоверительногоУправления.Действует), ЛОЖЬ) КАК ВидУправленияНеСоответствуетУсловиям
			|ИЗ
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий КАК _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ВсеЛицензииДоговоровДоверительногоУправления
			|		ПО _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.СчетДоверительногоУправления = ВсеЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
			|			И _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Лицензия = ВсеЛицензииДоговоровДоверительногоУправления.Лицензия
			|			И _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.ПериодЛицензииДоговоровДоверительногоУправления = ВсеЛицензииДоговоровДоверительногоУправления.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛицензииДоговоровДоверительногоУправления КАК ЛицензииДоговоровДоверительногоУправления
			|		ПО _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.СчетДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.СчетДоверительногоУправления
			|			И _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Лицензия = ЛицензииДоговоровДоверительногоУправления.Лицензия
			|			И _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.ПериодЛицензииДоговоровДоверительногоУправления = ЛицензииДоговоровДоверительногоУправления.Период
			|			И _ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.БанковскийСчет.ВидУправленияДовереннымиСредствами = ЛицензииДоговоровДоверительногоУправления.Лицензия.ВидДеятельности
			|
			|СГРУППИРОВАТЬ ПО
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Период,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.Организация,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.СчетДоверительногоУправления,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.ДепозитныйВклад,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.БанковскийСчет,
			|	_ДенежныеСредстваВКредитныхИнструментах_ПериодыУсловий.БанковскийСчет.ВидБанковскогоСчета <> ЗНАЧЕНИЕ(Перечисление.ВидыБанковскихСчетов.ДепозитныйСчет)";
		
		КредитныеИнструменты = ЭтотОбъект.Выгрузить(, "Период,Организация,СчетДоверительногоУправления,КредитныйИнструмент,ТипКредитногоИнструмента");
		Запрос.УстановитьПараметр("ДенежныеСредстваВКредитныхИнструментах", КредитныеИнструменты);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.НеЗаданыУсловияДоговоровДоверительногоУправления Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для счета внутреннего учёта '" + Строка(Выборка.СчетДоверительногоУправления) + "' не заданы условия договоров доверительного управления",,,, Отказ);
			ИначеЕсли Выборка.ВидБанковскогоСчетаНеДепозитныйВклад Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В расчётном счёте " + Выборка.БанковскийСчет + " 'Вид банковского счета' не является депозитным вкладом",,,, Отказ);	
			ИначеЕсли Выборка.ВидУправленияНеСоответствуетУсловиям Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В расчётном счёте " + Выборка.БанковскийСчет + " 'Вид управления доверенными средствами' не cоответствует условиям договоров доверительного управления",,,, Отказ);	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры
